In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine
import getpass

In [2]:
password = getpass.getpass() # in case you need to run it, password = 'password'

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

#### 1. How many distinct (different) actors' last names are there?

In [4]:
query_1 = '''SELECT last_name, count(last_name) as frequency 
FROM actor
GROUP BY last_name
HAVING frequency = 1;
'''

unique_last_names = pd.read_sql_query(query_1, engine)
display(unique_last_names)

      last_name  frequency
0       ASTAIRE          1
1        BACALL          1
2          BALE          1
3          BALL          1
4     BARRYMORE          1
..          ...        ...
61       WALKEN          1
62        WAYNE          1
63       WILSON          1
64  WITHERSPOON          1
65         WRAY          1

[66 rows x 2 columns]

#### 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [5]:
query_2 = '''SELECT rental_id, customer_id, rental_date, 
date_format(rental_date, '%%M') as 'rental_month', 
date_format(rental_date, '%%W') as 'rental_day', 
CASE
WHEN date_format(rental_date, '%%W') in ('Saturday', 'Sunday') then 'Weekend'
ELSE 'Workday'
END AS 'day_type'
FROM rental;
'''

week_days = pd.read_sql_query(query_2, engine)
display(week_days)

,rental_id,customer_id,rental_date,rental_month,rental_day,day_type
0,1,130,2005-05-24 22:53:30,May,Tuesday,Workday
1,2,459,2005-05-24 22:54:33,May,Tuesday,Workday
2,3,408,2005-05-24 23:03:39,May,Tuesday,Workday
3,4,333,2005-05-24 23:04:41,May,Tuesday,Workday
4,5,222,2005-05-24 23:05:21,May,Tuesday,Workday
...,...,...,...,...,...,...
16039,13486,274,2006-02-14 15:16:03,February,Tuesday,Workday
16040,15966,374,2006-02-14 15:16:03,February,Tuesday,Workday
16041,11676,216,2006-02-14 15:16:03,February,Tuesday,Workday
16042,14616,532,2006-02-14 15:16:03,February,Tuesday,Workday
16043,11739,373,2006-02-14 15:16:03,February,Tuesday,Workday

#### 3. Get all films with ARMAGEDDON in the title.

In [6]:
query_3 = '''SELECT title 
FROM film
WHERE title LIKE '%%ARMAGEDDON%%';'''

armaggedon = pd.read_sql_query(query_3, engine)
display(armaggedon)

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

#### 4. Get 10 of the longest films.

In [7]:
query_4 = '''SELECT title, length 
FROM film
ORDER BY length DESC
LIMIT 10;'''

longest_films = pd.read_sql_query(query_4, engine)
display(longest_films)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

#### 5. How many films include Behind the Scenes content?

In [8]:
query_5 = '''SELECT count(title) as 'movies_with_behind_the_scenes_content' 
FROM film
WHERE special_features LIKE '%%Behind the Scenes%%';'''

behind_scenes = pd.read_sql_query(query_5, engine)
display(behind_scenes)

   movies_with_behind_the_scenes_content
0                                    538

#### 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [9]:
query_6 = '''SELECT rating, 
sec_to_time(round(avg(length*60))) as movie_avg_duration 
FROM film
GROUP BY rating
HAVING movie_avg_duration > '02:00:00';
'''

rating_length = pd.read_sql_query(query_6, engine)
display(rating_length)

  rating movie_avg_duration
0  PG-13    0 days 02:00:27

#### 7. Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [10]:
query_7 = '''SELECT length, title, 
row_number() OVER (ORDER BY length DESC) as ranking 
FROM film
WHERE (length IS NOT NULL) and (length <> 0)
GROUP BY length
ORDER BY length DESC;
'''

length_ranking = pd.read_sql_query(query_7, engine)
display(length_ranking)

     length              title  ranking
0       185      CHICAGO NORTH        1
1       184  CONSPIRACY SPIRIT        2
2       183      CATCH AMISTAD        3
3       182    BAKED CLEOPATRA        4
4       181   ANALYZE HOOSIERS        5
..      ...                ...      ...
135      50   ADAPTATION HOLES      136
136      49    DOORS PRESIDENT      137
137      48     ACE GOLDFINGER      138
138      47    DIVORCE SHINING      139
139      46       ALIEN CENTER      140

[140 rows x 3 columns]